/*------------------------------------------------------------
    文件名称：TIMERl_INT.C 
    功能：16位定时器/计数器1，中断方式使用，控制蜂鸣器发声
    说明： 定时器/计数器1，8MHz下，时钟256分频，定时时间0.5s 
    --------------------------------------------------------------*/
    #include <avr/io.h>
    #include <avr/interrupt.h>
    /********************************************
    函数名称：SIGNAL(SIG_OUTPUT_COMPARE1A)
    功能：定时器/计数器1比较匹配中断的中断服务程序
    说明：重置计数初值，并对PE3端口取反，开/关声响
    入口参数：无
    返回值：无
    *********************************************/
    SIGNAL(SIG_OUTPUT_COMPARE1A)
    {
      TCNT1H = 0x00;      //T/C1计数值清零
      TCNT1L = 0x00;
      //对PE3取反，0.5秒改变一次; x ^= 1;
      if(PORTE & _BV(PE3))
        PORTE &= ~_BV(PE3);  //输出低电平
      else 
        PORTE |= (1<<PE3);   //输出高电平
    } 
     //主程序
int main(void) 
   {
      DDRE = _BV(PE3);   //初始化端口PE3为输出模式
      PORTE &= _BV(PE3); //输出高电平，蜂鸣器禁止发声
      TCCR1B = 0x00;     //中断控制寄存器清零，停止T/Cl计数  
      OCR1AH = 0x3D;     //设置8MHz、256分频、定时0.5s的比较值， 
      OCR1AL = 0x09;     //与TCNTl的计数值进行比较，若匹配产生中断
      TCCR1A = 0x00;     //T/C1普通端口模式
      TCCR1B = 0x04;     //启动定时器T/C1，256分频
      TIMSK |= 0x10;     //使能C/Tl比较匹配中断
      sei();             //允许全局中断
      while(1);          //等待中断的发生
    }
